In [1]:
import pandas as pd

In [2]:
# First create the column name for dataframe
df = pd.DataFrame(columns = ['Name', 'Age', 'Height'])

In [17]:
df

    Name  Age  Height
0  Allen   22     175
1   Elsa   29     169

In [6]:
# Add rows to dataframe by using df.loc[]
df.loc[0] = ['Allen', 22, 175]
df.loc[1] = ['Elsa', 29, 169]
df.loc[2] = ['Cart', 18, 160]

In [11]:
# can use df[""] to search all column
df["Age"]

0    22
1    29
2    18
Name: Age, dtype: int64

In [12]:
# can add new column
df['Weight'] = [50, 55, 53]

In [16]:
# drop can only drop by row. if you want to drop the column need to set axis = 1, or drop will search the index not column.
# drop will not save the result, you need to assign again with drop

df = df.drop(2)
df = df.drop('Weight', axis = 1)

In [ ]:
# cam modify result
df["Height"] = [180, 184]

# if we have same result in same column
df["Height"] = 188

In [20]:

# can also create dataframe with all data result
columns = ["Name", "Age", "Height"]
data = [
    ['Jen', 22, 175],
    ['Baiden', 29, 169],
    ['Trump', 59, 184]
]
df2 = pd.DataFrame(
    data = data,
    columns = columns
)

In [21]:
df2

     Name  Age  Height
0     Jen   22     175
1  Baiden   29     169
2   Trump   59     184

In [22]:
# concat function can use to union the data
df_union = pd.concat(
    [df, df2]
)
df_union

     Name  Age  Height
0   Allen   22     175
1    Elsa   29     169
0     Jen   22     175
1  Baiden   29     169
2   Trump   59     184

In [24]:
# we can use .reset_index() to reset the index. if we want to remove the old index, set drop = True
df_union = pd.concat(
    [df, df2]
).reset_index(drop = True)

df_union

     Name  Age  Height
0   Allen   22     175
1    Elsa   29     169
2     Jen   22     175
3  Baiden   29     169
4   Trump   59     184

In [27]:
# use to_csv to save dataframe as csv. 
# index = False can remove the index when saving the csv
# header = None can remove the column name
df_union.to_csv("basic.csv", index = False)
df_union.to_csv("basic_no_column.csv", 
                index = False,
                header = None)

In [ ]:
# we should use .copy() to copy the dataframe instead of assign it since assign will still use the same memory.

# df_replica = df # ----> wrong method
df_replica = df.copy()